Repository: S031/MetaStack
Catalog: src/S031.MetaStack.Core/Properties/Strings.*.resx
Languages: ru_ru

# S031.MetaStack.Core.Actions.CreateEvaluator.1
source: Required interface parameter '{0}. {1}', not found in the parameter list of operation '{2}'
ru_ru: Обязательный параметер интерфейса '{0}.{1}', не найден в списке параметров операции '{2}'

# S031.MetaStack.Core.Actions.CreateEvaluator.2
source: Number of operation parameters '{0}', does not match interface '{1}'
ru_ru: Количество параметров операции '{0}', не соответствует интерфейсу '{1}'

# S031.MetaStack.Core.App.AppHost.1
source: The config.json configuration file was not found
ru_ru: Не найден файл конфигурации приложения config.json

# S031.MetaStack.Core.Data.DbProviderFactories.GetFactory.1
source: The {0} type does not have a static "Instance" field that returns an instance of DbProviderFactory
ru_ru: Тип {0} не имеет статического поля Instance, возвращающего экземпляр DbProviderFactory

# S031.MetaStack.Core.Data.DbProviderFactories.GetFactory.2
source: The type derived from DbProviderFactory was not found in {0}
ru_ru: В {0} не найден тип производный от DbProviderFactory

# S031.MetaStack.Core.Data.DbProviderFactories.GetFactory.3
source: An assembly containing definitions for {0} was not found
ru_ru: Не найдена сборка содержащая определения для {0}

# S031.MetaStack.Core.Data.DbProviderFactories.GetFactory.4
source: No library containing definitions for {0}
ru_ru: Не найдена билиотека содержащая определения для {0}

# S031.MetaStack.Core.Data.MdbContext.array2List.1
source: Parameter a must implements IEnumerable<> interface
ru_ru: Параметр должен реализовывать интерфейс IEnumerable<>

# S031.MetaStack.Core.Data.MdbContext.array2List.2
source: IEnumerable <{0}> argument type not supported
ru_ru: Тип аргумента IEnumerable<{0}> не поддерживается

# S031.MetaStack.Core.Data.MdbContext.Commit.1
source: Can't call Commit method without transaction
ru_ru: Невозможно вызвать Commit метод вне активной транзакции

# S031.MetaStack.Core.Data.ObjectFactories.GetFactories.1
source: The type derived from {0} was not found in service collection
ru_ru: Тип производный от {0} не найден в service collection

# S031.MetaStack.Core.Data.writeData.1
source: The length of the data array must be equal to the length of the array of field names
ru_ru: Длинна массива данных должна быть равна длинне массива наименований полей

# S031.MetaStack.Core.ORM.JMXProvider.ObjectNotFound
source: Object '{0}' with specified id '{1}' not found in the database
ru_ru: Объект '{0}' с указанным идентификатором '{0}' не найден в базе данных

# S031.MetaStack.Core.ORM.JMXSchema.ctor.1
source: Not found the schema of the object '{0}'
ru_ru: Не найдена схема объекта '{0}'

# S031.MetaStack.Core.ORM.JMXSchema.ParseXml.1
source: Missing required element '{0}'
ru_ru: Отсутствует обязательный элемент: '{0}'

# S031.MetaStack.Core.ORM.JMXSchemaProviderDB.normalize.3
source: The FieldName '{0}' specified in the {1} is not in the attribute list
ru_ru: Имя поля (FieldName:{0}), указанное в {1} отсутствует в списке атрибутов

# S031.MetaStack.Core.ORM.JMXSchemaProviderDB.normalize.4
source: The field '{0}' has an invalid data type
ru_ru: Тип данных поля '{0}' указан неверно

# S031.MetaStack.Core.ORM.JMXSchemaProviderDB.normalize.5
source: A primary key is required for a table '{0}' that includes columns of type 'object'
ru_ru: Требуется первичный ключ для таблицы '{0}', включающей столбцы типа 'object'

# S031.MetaStack.Core.SecurityAuthorizationExceptions.GetMessage.1
source: Permission denied for user {0} to execute '{1}' of object '{2}'
ru_ru: Полномочий пользователя {0} недостаточно для выполнения метода '{1}' объекта '{2}'

# S031.MetaStack.Core.SysCat.SysCatManager.getSchema.1
source: Object schema '{0}' not found in database
ru_ru: Схема объекта '{0}' не найдена в базе данных

# S031.MetaStack.Core.SysCat.SysCatManager.getSchema.2
source: Object schema '{0}' with the SyncState={1} not found in database
ru_ru: Схема объекта '{0}' с кодом синхронизации {1} не найдена в базе данных

# S031.MetaStack.Services.TCPServerService.Accept.1
source: The minimum message length can not be less than 32 bytes
ru_ru: Минимальная длинна сообщения не может быть мнее 32 бйт
